Tekla.Structures.Drawing.CastUnitDrawing
The CastUnitDrawing class is for handling cast unit drawings.

Tekla.Structures.Drawing.CastUnitDrawing.CastUnitIdentifier
The identifier of the model object cast unit.

Tekla.Structures.Drawing.CastUnitDrawing.SheetNumber
The sheet number of the drawing.

Tekla.Structures.Drawing.CastUnitDrawing.CastUnitById
Cast unit definition method.
True means the cast unit definition method is by cast unit id.
False means the cast unit definition method is by cast unit position.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier)
Instantiates a new cast unit drawing with standard attributes for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,System.String)
Instantiates a new cast unit drawing with given attributes for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType)
Instantiates a new cast unit drawing with standard attributes for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
castUnitDrawingCreationType: Specifies the cast unit drawing creation type (by cast unit id or by cast unit position).

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType,System.String)
Instantiates a new cast unit drawing with given attributes for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
castUnitDrawingCreationType: Specifies the cast unit drawing creation type (by cast unit id or by cast unit position).
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,System.Int32)
Instantiates a new cast unit drawing with standard attributes and with a specified sheet number for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
sheetNumber: The sheet number of the drawing.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,System.Int32,System.String)
Instantiates a new cast unit drawing with given attributes and with a specified sheet number for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
sheetNumber: The sheet number of the drawing.
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType,System.Int32)
Instantiates a new cast unit drawing by id with standard attributes and with a specified sheet number for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
castUnitDrawingCreationType: Specifies the cast unit drawing creation type (by cast unit id or by cast unit position).
sheetNumber: The sheet number of the drawing.

Tekla.Structures.Drawing.CastUnitDrawing.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType,System.Int32,System.String)
Instantiates a new cast unit drawing by id with given attributes and with a specified sheet number for a given cast unit.
castUnitIdentifier: The identifier of the model object cast unit.
castUnitDrawingCreationType: Specifies the cast unit drawing creation type (by cast unit id or by cast unit position).
sheetNumber: The sheet number of the drawing.
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.CastUnitDrawing.Modify
Updates the drawing object in the database.
Returns: True on success.

Tekla.Structures.Drawing.CastUnitDrawing.Insert
Inserts a new cast unit drawing. Views are added according to the View Creation rules of the standard file.
A drawing can be inserted only when there is no active drawing.
Returns: True on success.
Throws Tekla.Structures.Drawing.CannotInsertDrawingException: Thrown if inserting a drawing when another drawing is active.

Tekla.Structures.Drawing.CastUnitDrawing.Select
Selects the drawing.
Returns: True on success.